{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "AzLh-2WyMjf6TYATFwg6NA", "review_id": "0ESSqLfOae77muWTv_zUqA", "stars": 3, "date": "2011-02-11", "text": "Lately i have been feeling homesick for asian food and been hitting up places that i haven't been to in awhile.  Recently re-visited Thai Pan for a quick lunch and quickly ordered without spending too much time perusing the menu.  It looked more diverse than I remembered including some Vietnamese additions.  I remembered the curries and stir-fry dishes were ok but nothing really memorable.  A quick summary for my latest visit:\n\nPros:\n- convenient order-at-the counter setup\n- self-serve drink station\n- brown and white rice mixture\n- friendly and gracious owners\n\nCons:\n- too much napa cabbage in comparison to green vegetables \n- wish the owner/chef would be back in the kitchen vs. managing\n- spice level on the weak side", "type": "review", "business_id": "1_X3PGhk3Y5JWVi866qlJg"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "AzLh-2WyMjf6TYATFwg6NA", "review_id": "VyAKIaj_Rmsf_ZCHcGJyUw", "stars": 5, "date": "2010-05-30", "text": "I love Marilo!  She understands my hair type and knows exactly what to do with my hair.  She keeps a record of my previous visits.  She recommends what is best for my hair.  She is pleasant to work with: easygoing, friendly, and respectful.  I've been going to her since 2008.  I'm really picky with hair people, and I used to go back to Chicago for haircuts.  Now, I stick to Marilo.", "type": "review", "business_id": "2brM7wqtmoNncqjc6GtFaQ"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "BYV6bmTSgbZMGkvXHVCowg", "review_id": "DusrkpkTGPGkqK13xO1TZg", "stars": 3, "date": "2011-11-26", "text": "Standard Chipotle fare - consistently good; not bad for corporate food - if you have a few minutes, there are a number of good local offerings within walking distance.", "type": "review", "business_id": "3lbvsGKzhjuX3oJtaXJvOg"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "BYV6bmTSgbZMGkvXHVCowg", "review_id": "A5FL-YYXnr2hnvXQbgkkrQ", "stars": 4, "date": "2013-10-10", "text": "Very good prices with quality ingredients.", "type": "review", "business_id": "4jxoKVsRJwEoa8zd9XxlAw"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "BYV6bmTSgbZMGkvXHVCowg", "review_id": "SzhIWfzLHUZfiAaVTtKHxw", "stars": 1, "date": "2012-09-02", "text": "I went to this Petco a few times and was a bit appalled at their rodents section, to be perfectly honest. Granted, it wasn't as bad as it could have been, but in my opinion, it was unacceptable.\n\nFor one thing, there was six or seven rats packed in one cage that was, what . . . \n1' x 9\", 1 x 8\"? Don't quote me on that - I'm not 100% sure, but regardless of the details, it was way too small for the number of rats that were in it. They weren't unhealthy; they didn't look very sick, but they definitely didn't look particularly healthy, either. \n\nThe guinea pigs were what really shocked me, though. If you know anything about guinea pigs, you'll know they need a lot of space - even just for one. This cage was the same size as the rat's cage (they all were). They barely had enough to room to walk, much less exercise or popcorn (which my guinea pigs do often). There were two guinea pigs packed in that thing, when it was way, way too small for one baby guinea pig. It also didn't look that clean - all the cages, in my opinion, were grungy. The whole place felt grungy and grimy. And they obviously weren't cleaning the cages everyday, which they should be doing. It would be more unfair to the animals to do anything but at least a small cleaning each day.\n\nThe prices are, indeed, pretty good, or at least better than the prices at the Petsmart I usually go to, so there's one point for Petco. \n\nAt last, the employees. Are they nice and cheerful? Yes. That is, until you politely point out that the guinea pig cage is way too small for them to be healthy and happy (I was trying my hardest to be polite, although I could have come across as rude), they (or the one I talked to) immediately turn defensive, telling you \"it's very temporary\" and \"we take them out every night\" (which I don't believe, but maybe a Petco employee can correct me on that?) and make a face at you, not once telling you they'll tell their manager (even if they won't) or you may be right, like a good employee would.\n\nWant your customers to come back? Here's a good tip: don't tell them they're wrong about something, and rudely correct them, obviously trying to rush them out. Humor them, even if they are wrong about something.\n\nOverall, I would recommend not shopping here. They don't take good care of their pets, and their employees are rude if you care about the animals when they plainly don't. Good prices? They don't make up for that.\n\nI apologize if I made this too long, and thank you if you read all of this, regardless of whether or not you agree with me.", "type": "review", "business_id": "528yjMqyZnbCtabroJN_aA"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "CduCDxDMiRJJbc2CmnziAg", "review_id": "EaBnd0MGL61KhvFwS3bQvQ", "stars": 4, "date": "2011-05-16", "text": "This is the first unique (not chain) brunch place I have found in the east valley that serves alcohol! The food was DELISH! finally", "type": "review", "business_id": "1_X3PGhk3Y5JWVi866qlJg"}
{"votes": {"funny": 1, "useful": 5, "cool": 3}, "user_id": "DEeuYhLuzvvrJ9v2pVrTjQ", "review_id": "Rp1yvabsZ76dNwjG1MMTkA", "stars": 2, "date": "2009-04-16", "text": "Brian S. Sum's it up perfectly with \"if you're going to try to be a Hooters/Library sports bar rip-off, hire more attractive, more in-shape waitresses to wear those cheesy uniforms.\"\n\nThe only reason I give it a second star is because it's so close to home and they're open till 2, so I can't hate totally.", "type": "review", "business_id": "2brM7wqtmoNncqjc6GtFaQ"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "DEeuYhLuzvvrJ9v2pVrTjQ", "review_id": "rrIMJijS60XTgjRTGBCLcw", "stars": 3, "date": "2008-08-25", "text": "Remember the no-bake cookies of your elementary school cafeteria?! Chocolate, peanut butter and rolled oats in a gooey lump? Uh, yea... you can buy giant ones here for $1.95!! Totally rich; great excuse for a school yard flashback. (Warning: I do NOT advise attempting to eat the whole thing yourself.)\n\nAlso, they have cookies with full sized Resese's peanut butter cups in the middle... yummm...", "type": "review", "business_id": "3lbvsGKzhjuX3oJtaXJvOg"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "DEeuYhLuzvvrJ9v2pVrTjQ", "review_id": "6z6wOKSFVcZfCdhOPcZY5g", "stars": 5, "date": "2012-01-02", "text": "I love coming to this bar. Friendly bartenders and a beautiful view.", "type": "review", "business_id": "4jxoKVsRJwEoa8zd9XxlAw"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "DEeuYhLuzvvrJ9v2pVrTjQ", "review_id": "zSZ47fXX02XGxTJSQ-vulg", "stars": 5, "date": "2012-04-10", "text": "Great sushi rolls and BYOB!  Very friendly staff.  Three for lunch $25 per person including a generous tip.  Love this place!", "type": "review", "business_id": "528yjMqyZnbCtabroJN_aA"}
